[
  {
    "version": "0.3.0",
    "date": "2025-10-07",
    "features": [
      {
        "title": "Contributors Management in Curation Form",
        "description": "Added comprehensive contributors section to the DataCite form with support for persons and institutions, role management using Tagify-based inputs, and affiliation handling. Contributors are distinguished from authors and support various contributor types including research groups."
      },
      {
        "title": "Save Contributors with Roles and Affiliations",
        "description": "Complete persistence of contributor data alongside authors with form hydration using stored contributors, support for multiple roles per contributor, normalization of affiliation data, and reuse of existing institutions. Includes unified serialization logic for affiliations to reduce code duplication."
      },
      {
        "title": "Import Contributors from DataCite XML",
        "description": "Automatically extract contributors from uploaded DataCite XML files with role normalization, deduplication of contributors, and proper handling of research groups as institutions. Supports Work Package Leader and other contributor-specific roles."
      },
      {
        "title": "API for Old Dataset Contributors",
        "description": "New endpoint to fetch contributors (excluding authors) from legacy datasets with intelligent role mapping from legacy role names to new slugs. Includes enhanced person/institution detection logic with name parsing utilities, support for comma-separated names, and comprehensive tests (Vitest, Playwright)."
      },
      {
        "title": "Roles API Endpoint",
        "description": "New API endpoint to fetch available roles with metadata columns and activation flags. Includes author-specific and contributor-specific role filtering, OpenAPI documentation, and service-specific API key protection. Role configuration is frozen to ensure consistency."
      }
    ],
    "improvements": [
      {
        "title": "Contributors Section UX",
        "description": "Contributors accordion is now expanded by default on the curation form for better visibility and easier data entry."
      },
      {
        "title": "API Documentation Refinement",
        "description": "Restricted public API documentation to secured ELMO endpoints only, improving security and clarity of the API surface."
      },
      {
        "title": "Code Organization",
        "description": "Enforced consistent import sorting via ESLint, refactored import order across multiple components for improved readability, and extracted shared Tagify helpers for DataCite tests to reduce code duplication."
      },
      {
        "title": "Affiliation Data Quality",
        "description": "Enhanced affiliation serialization to trim whitespace, filter out empty affiliations, deduplicate entries, and normalize values to ensure data quality."
      },
      {
        "title": "Database Schema Clarity",
        "description": "Renamed author_role pivot table to resource_author_role for improved clarity and consistency in Eloquent relationships."
      },
      {
        "title": "Session Management in Production",
        "description": "Introduced SESSION_PATH environment variable to docker-compose.prod.yml for improved session handling in production environments."
      }
    ],
    "fixes": [
      {
        "title": "Author/Contributor Role Filtering",
        "description": "Refactored role filtering logic to explicitly filter ResourceAuthors based on the 'applies_to' property at the controller level instead of in model relationships, improving accuracy and maintainability."
      },
      {
        "title": "Playwright Test Selectors",
        "description": "Scoped author Playwright selectors to authors panel and fixed author indexing to prevent test flakiness and improve test reliability."
      },
      {
        "title": "Contributor Role Field",
        "description": "Made roles input field required for contributors and disabled dropdown to enforce proper role selection through the tag input interface."
      },
      {
        "title": "PHPStan Warnings",
        "description": "Resolved PHPStan warnings in contributor deduplication logic and role scope annotations with Builder generics."
      }
    ]
  },
  {
    "version": "0.2.0",
    "date": "2025-10-06",
    "features": [
      {
        "title": "Authors Management in Curation Form",
        "description": "Added comprehensive authors section with support for persons and institutions, ORCID input fields, contact person functionality, role and affiliation management using Tagify-based inputs, and extensive end-to-end tests with Playwright. Includes accessible implementation with optimized aria-label usage."
      },
      {
        "title": "ROR Affiliation Synchronization",
        "description": "Integrated Research Organization Registry (ROR) with automatic data synchronization, autocomplete functionality for affiliations with ROR IDs, support for ZIP archives containing ROR data, and a new data structure using prefLabel, rorId, and otherLabel fields. Includes comprehensive tests for ROR data fetching and processing."
      },
      {
        "title": "Import Authors from DataCite XML",
        "description": "Automatically extract authors from uploaded DataCite XML files with proper handling of nested creator elements."
      },
      {
        "title": "API for Old Dataset Authors",
        "description": "New endpoint to fetch authors from legacy datasets with fuzzy matching for contact information and affiliations. Frontend integration automatically loads legacy authors into the curation form. Includes ORCID support, optimized queries to avoid N+1 problems, improved name normalization with diacritic removal, and comprehensive tests (Pest, Playwright, Vitest)."
      },
      {
        "title": "ROR ID Badges for Affiliations",
        "description": "Display ROR ID badges for matched affiliations with clickable links to ROR identifiers, improved normalization of affiliation data, and consistent formatting of ROR URLs."
      },
      {
        "title": "Persistent Sorting for Old Datasets",
        "description": "Added sorting controls for the old datasets table with lazy loading that respects server-side sorting and persistent storage of sort preferences."
      },
      {
        "title": "Store Authors with Roles and Affiliations",
        "description": "Complete persistence of author management data with form hydration using stored authors, support for ROR IDs for institutions, normalization of boolean values, and reuse of existing institutions."
      },
      {
        "title": "API Key Authentication for ELMO Resource Types",
        "description": "Protected ELMO endpoint with configurable API key using new ELMO_API_KEY environment variable. Configuration added to .env.example and stack.env with updated tests for consistent test environment."
      },
      {
        "title": "Dashboard Statistics Card",
        "description": "Show total datasets count on dashboard with new statistics card."
      }
    ],
    "improvements": [
      {
        "title": "Test Timeout Adjustments",
        "description": "Increased timeout for DataCiteForm author management tests to improve test reliability."
      },
      {
        "title": "Layout and Accessibility Enhancements",
        "description": "Improved layout and accessibility for author fields with optimized spacing and better screen reader support."
      },
      {
        "title": "Query Optimization",
        "description": "Optimized queries for contact information matching to reduce database load and improve performance."
      },
      {
        "title": "Error Handling",
        "description": "Enhanced error handling and messaging throughout the application for better user feedback."
      }
    ],
    "fixes": [
      {
        "title": "DataCite Author Extraction",
        "description": "Fixed DataCite author extraction to correctly ignore nested creator elements."
      },
      {
        "title": "PHPStan Issues",
        "description": "Resolved PHPStan issues for ROR synchronization and author affiliations."
      },
      {
        "title": "JSON File Error Handling",
        "description": "Improved error handling for JSON file read operations."
      },
      {
        "title": "TagInputField Dropdown Settings",
        "description": "Corrected dropdown settings merge in TagInputField component."
      },
      {
        "title": "MockTagify Reset",
        "description": "Fixed MockTagify removeAllTags method to correctly clear the value array."
      }
    ]
  },
  {
    "version": "0.1.0",
    "date": "2025-10-05",
    "features": [
      {
        "title": "Resources workspace",
        "description": "Browse curated resources with metadata badges, DOI links, pagination details, and quick edit or delete actions."
      },
      {
        "title": "Dashboard overview",
        "description": "Surface key statistics like the total resource count alongside shortcuts to curation and documentation."
      },
      {
        "title": "Resource Information form group",
        "description": "Added structured resource information section."
      },
      {
        "title": "License and Rights form group",
        "description": "Include license and rights details for resources."
      },
      {
        "title": "Link to Dev Repository",
        "description": "Added link to the development repository on GitHub for transparency."
      },
      {
        "title": "Changelog",
        "description": "Added a interactive changelog to track updates and changes."
      },
      {
        "title": "User creation",
        "description": "Added admin command to create new users."
      },
      {
        "title": "User documentation",
        "description": "Added new site for user documentation and help."
      },
      {
        "title": "Footer",
        "description": "Added a footer with link to legal notice, changelog and about page."
      },
      {
        "title": "SPDX sync",
        "description": "Added a new command for auto syncing SPDX licenses from spdx.org."
      }
    ],
    "improvements": [
      {
        "title": "Framework Setup",
        "description": "Set up Laravel 12 with React"
      },
      {
        "title": "Testing Enhancements",
        "description": "Improved test coverage and reliability with modern testing frameworks Pest, Vitest and Playwright."
      },
      {
        "title": "Registration closed",
        "description": "Closed registration so only admins can add new users."
      },
      {
        "title": "Resource table layout",
        "description": "Streamlined the resources list with clearer spacing, responsive formatting, and accessible typography."
      },
      {
        "title": "Deletion confirmations",
        "description": "Added confirm dialogs and loading states so resource removals stay intentional and transparent."
      }
    ]
  }
]
